cv.md


# contact

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">:----&#x2013;&#x2014;:</td>
<td class="org-left">: ------------------&#x2013;&#x2014;:</td>
</tr>


<tr>
<td class="org-left">location :</td>
<td class="org-left"><b>körfez/kocaeli - Turkey</b></td>
</tr>


<tr>
<td class="org-left">email :</td>
<td class="org-left"><b>mal1kc@proton.me</b></td>
</tr>
</tbody>
</table>


# education

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">:-              -:</td>
<td class="org-left">:-                                         -:</td>
<td class="org-left">:-                -:</td>
<td class="org-left">:-      -:</td>
</tr>


<tr>
<td class="org-left">*09.2020-2023</td>
<td class="org-left"><b>kocaeli university - computer programming</b></td>
<td class="org-left"><b>kocaelii ,turkey</b></td>
<td class="org-left"><code>3.19</code></td>
</tr>


<tr>
<td class="org-left">:-             -:</td>
<td class="org-left">:-                                          -:</td>
<td class="org-left">:-                -:</td>
<td class="org-left">:-      -:</td>
</tr>


<tr>
<td class="org-left">09.2016-06.2020</td>
<td class="org-left"><b>derince necip fazıl anadolu highschool</b></td>
<td class="org-left"><b>kocaeli, turkey</b></td>
<td class="org-left"><code>85/100</code></td>
</tr>
</tbody>
</table>


# skills/compentencies

-   languages :
    -   english | b1
    -   türkçe | native

-   compentencies :
    -   linux
        -   arch
        -   alpine
        -   debian derivatives
    
    -   container technoliges:
        -   docker compose,register

-   tools & techs :
    -   python modules
        -   flask
        -   django
        -   telegram
        -   pyzmq
        -   opencv
        -   tkinter
        -   pyqt
    
    -   vsc (version control systems)
        -   git
        -   remote :
            -   github
            -   gitlab
    
    -   ms-office
        -   excel
        -   word
        -   powerpoint

-   programming languages
    -   python `advanced`
    -   c `intermediate`
    -   c++ `advanced beginner`
    -   php `beginner`
    -   c# `advanced beginner`
    -   javascript `beginner`
    -   dart `beginner`
    -   lua `beginner`
    -   markup-languages
        -   html
        -   css
        -   org-mode (emacs)
        -   markdown
    -   posix-shell, scripting
        -   bash,dash
        -   fishell


# certficates i take

-   `06.20.21` - `python` course certificate of completion - udemy (online)


# projects

-   [github profile](https://github.com/mal1kc)  where all my repos (mostly)

-   some repos from github profile of mine
    -   [my blog created via github pages](https://mal1kc.github.io/)
    
    -   [flask-todo](https://github.com/mal1kc/flask-todo) to-do web app programmed in python with flask,sqlalchemy,sqlite,passlib modules and bootstrap5
    -   [python-notes](https://github.com/mal1kc/python-1udemy) my solutions and notes whlie [i taking a python course](https://www.udemy.com/course/sifirdan-ileri-seviyeye-python)
    
    -   [cvs-table-explorer](https://github.com/mal1kc/cvs-table-explorer) one page explorer for .cvs files

